Revit 2026 API

# OverridePermissions Enumeration

---

Types of overrides that can be applied to a category.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum OverridePermissions
```
```vb
Public Enumeration OverridePermissions
```
```cpp
public enum class OverridePermissions
```
```fsharp
type OverridePermissions
```

| Member name | Value | Description |
| --- | --- | --- |
| CutFills | 4 | Cut fills |
| CutLines | 3 | Cut lines |
| Halftone | 2 | Halftone |
| ProjectionFills | 6 | Projection fills |
| ProjectionLines | 5 | Projection lines |
| Surfaces | 7 | Surface transparency |
| ViewDetailLevel | 1 | View detail level |

#### Reference

Autodesk.Revit.DB Namespace